**复习**：在前面我们已经学习了Pandas基础，第二章我们开始进入数据分析的业务部分，在第二章第一节的内容中，我们学习了数据的清洗，这一部分十分重要，只有数据变得相对干净，我们之后对数据的分析才可以更有力。而这一节，我们要做的是数据重构，数据重构依旧属于数据理解（准备）的范围。

开始之前，导入numpy、pandas包和数据

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('train-left-up.csv')

In [3]:
df.head(10)

,PassengerId,Survived,Pclass,Name
0,1,0,3,"Braund, Mr. Owen Harris"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina"
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)"
4,5,0,3,"Allen, Mr. William Henry"
5,6,0,3,"Moran, Mr. James"
6,7,0,1,"McCarthy, Mr. Timothy J"
7,8,0,3,"Palsson, Master. Gosta Leonard"
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)"
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)"

# 2 第二章：数据重构
## 2.4 数据的合并
### 2.4.1 任务一：将data文件夹里面的所有数据都载入，观察数据的之间的关系

In [4]:
df1 = pd.read_csv('train-left-down.csv')
df2 = pd.read_csv('train-right-up.csv')
df3 = pd.read_csv('train-right-down.csv')
df1.head(10)

   PassengerId  Survived  Pclass                                         Name
0          440         0       2       Kvillner, Mr. Johan Henrik Johannesson
1          441         1       2  Hart, Mrs. Benjamin (Esther Ada Bloomfield)
2          442         0       3                              Hampe, Mr. Leon
3          443         0       3                    Petterson, Mr. Johan Emil
4          444         1       2                    Reynaldo, Ms. Encarnacion
5          445         1       3            Johannesen-Bratthammer, Mr. Bernt
6          446         1       1                    Dodge, Master. Washington
7          447         1       2            Mellinger, Miss. Madeleine Violet
8          448         1       1                  Seward, Mr. Frederic Kimber
9          449         1       3               Baclini, Miss. Marie Catherine

In [7]:
df.shape

(439, 4)

In [8]:
df1.shape

(452, 4)

应该是将原数据像切蛋糕一样分成四份，或者类似坐标系的四个象限。那么连接数据就要横向、纵向连接。  

### 2.4.2：任务二：使用concat方法：将数据train-left-up.csv和train-right-up.csv横向合并为一张表，并保存这张表为result_up  
### 2.4.3 任务三：使用concat方法：将train-left-down和train-right-down横向合并为一张表，并保存这张表为result_down。然后将上边的result_up和result_down纵向合并为result。

In [9]:
result_up = pd.concat([df, df2], axis= 1)
result_down = pd.concat([df1, df3], axis= 1)
result = pd.concat([result_up, result_down], axis= 0)
result.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### 2.4.4 任务四：使用DataFrame自带的方法join方法和append：完成任务二和任务三的任务

In [15]:
result_up1 = df.join(df2)
result_down1 = df1.join(df3)
result1 = result_up1.join(result_down1, how = "outer")
result1.head()
# print(result_up1.info())
# print(result_down1.info())

ValueError: columns overlap but no suffix specified: Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

join不能上下拼接，只能找并集交集（为什么并集不能上下拼接呢？）而append是添加行，用于行拼接。

### 2.4.5 任务五：使用Panads的merge方法和DataFrame的append方法：完成任务二和任务三的任务

In [24]:
result_up2 = pd.merge(df, df2, left_index= True, right_index= True, how = 'left')
result_down2 = pd.merge(df1, df3, left_index= True, right_index= True, how = 'left')
result2 = result_up2.append(result_down2)
result2.head()

C:\Users\Li\AppData\Local\Temp\ipykernel_25112\4012938222.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  result2 = result_up2.append(result_down2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [16]:
result1 = result_up1.append(result_down1)
result1.head()

C:\Users\Li\AppData\Local\Temp\ipykernel_25112\1623014356.py:1: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  result1 = result_up1.append(result_down1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [17]:
result1.shape

(891, 12)

### 2.4.6 任务六：完成的数据保存为result.csv

In [18]:
result.to_csv('result.csv')

## 2.5 换一种角度看数据
### 2.5.1 任务一：将我们的数据变为Series类型的数据

In [28]:
data_unit = pd.read_csv('result.csv').stack()
data_unit

0    Unnamed: 0                           0
     PassengerId                          1
     Survived                             0
     Pclass                               3
     Name           Braund, Mr. Owen Harris
                             ...
890  SibSp                                0
     Parch                                0
     Ticket                          370376
     Fare                              7.75
     Embarked                             Q
Length: 10717, dtype: object

## 2.6 数据运用
### 2.6.1 任务一：通过教材《Python for Data Analysis》P303、Google or anything来学习了解GroupBy机制

回答：GroupBy是一种聚合方法，用于分类求不同组内特征值。

### 2.6.2：任务二：计算泰坦尼克号男性与女性的平均票价

In [61]:
df = pd.read_csv('result.csv')
Fare = df.groupby('Sex')['Fare'].mean()
Fare

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [31]:
Fare.describe()

        count       mean        std   min        25%   50%    75%       max
Sex
female  314.0  44.479818  57.997698  6.75  12.071875  23.0  55.00  512.3292
male    577.0  25.523893  43.138263  0.00   7.895800  10.5  26.55  512.3292

### 2.4.3：任务三：统计泰坦尼克号中男女的存活人数

In [62]:
df = pd.read_csv('result.csv')
Survived = df.groupby('Sex')['Survived'].sum()
Survived

Sex
female    233
male      109
Name: Survived, dtype: int64

### 2.4.4：任务四：计算客舱不同等级的存活人数

In [34]:
Survived = df['Survived'].groupby(df['Pclass'])
Survived.value_counts()

Pclass  Survived
1       1           136
        0            80
2       0            97
        1            87
3       0           372
        1           119
Name: Survived, dtype: int64

df['Fare'].groupby(df['Sex']).agg('mean')

In [60]:
Survived = df.groupby('Pclass')['Survived'].sum()
Survived

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [48]:
df.groupby('Pclass')['Survived'].sum()

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

### 2.4.5：任务五：统计在不同等级的票中的不同年龄的船票花费的平均值

In [59]:
a = df.groupby(['Pclass', 'Age'])['Fare'].mean()
a.type

AttributeError: 'Series' object has no attribute 'type'

In [63]:
sex_fare_survived = pd.merge(Fare, Survived, on = 'Sex')
sex_fare_survived

             Fare  Survived
Sex
female  44.479818       233
male    25.523893       109

In [64]:
sex_fare_survived.to_csv('sex_fare_survived.csv')

### 2.4.7：任务七：得出不同年龄的总的存活人数，然后找出存活人数最多的年龄段，最后计算存活人数最高的存活率（存活人数/总人数）

In [68]:
df['Age bins'] = pd.cut(df['Age'], 5, labels= [1,2,3,4,5])
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age bins
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,2
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,2
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,3
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,3

In [69]:
df.groupby('Age bins')['Survived'].sum()

Age bins
1     55
2    128
3     76
4     30
5      1
Name: Survived, dtype: int64

In [72]:
df.groupby('Age bins')['Survived'].count()

Age bins
1    100
2    346
3    188
4     69
5     11
Name: Survived, dtype: int64

In [70]:
df.groupby('Age bins')['Survived'].sum()/df.groupby('Age bins')['Survived'].count()

Age bins
1    0.550000
2    0.369942
3    0.404255
4    0.434783
5    0.090909
Name: Survived, dtype: float64

In [71]:
(df.groupby('Age bins')['Survived'].sum()/df.groupby('Age bins')['Survived'].count()).max()

0.55

In [73]:
df['Age'].max()-df['Age'].min()

79.58

In [74]:
df['Age'].min()+79.58/5

16.336000000000002